#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/d60217e1-8b17-4c70-bedb-49692ddc5f13/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurecaf_name.caf_name_ase_rg will be created
  + resource "azurecaf_name" "caf_name_ase_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "ase",
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.caf_name_ase_v3[0] will be created
  + resource "azurecaf_name" "caf_name_ase_v3" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_app_service_environment"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.caf_name_law will be created
  + resource "azurecaf_name" "caf_name_law" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.caf_name_network_rg will be created
  + resource "azurecaf_name" "caf_name_network_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "network",
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.caf_name_shared_rg will be created
  + resource "azurecaf_name" "caf_name_shared_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "shared",
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.law will be created
  + resource "azurecaf_name" "law" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurerm_app_service_environment_v3.ase[0] will be created
  + resource "azurerm_app_service_environment_v3" "ase" {
      + allow_new_private_endpoint_connections = true
      + dns_suffix                             = (known after apply)
      + external_inbound_ip_addresses          = (known after apply)
      + id                                     = (known after apply)
      + inbound_network_dependencies           = (known after apply)
      + internal_inbound_ip_addresses          = (known after apply)
      + internal_load_balancing_mode           = "Web, Publishing"
      + ip_ssl_address_count                   = (known after apply)
      + linux_outbound_ip_addresses            = (known after apply)
      + location                               = (known after apply)
      + name                                   = (known after apply)
      + pricing_tier                           = (known after apply)
      + resource_group_name                    = (known after apply)
      + subnet_id                              = (known after apply)
      + windows_outbound_ip_addresses          = (known after apply)
      + zone_redundant                         = true
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westus2"
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = (known after apply)
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
        }
      + workspace_id                       = (known after apply)
    }

  # azurerm_resource_group.ase will be created
  + resource "azurerm_resource_group" "ase" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
        }
    }

  # azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
        }
    }

  # azurerm_resource_group.shared will be created
  + resource "azurerm_resource_group" "shared" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
        }
    }

  # module.app_service.azurecaf_name.caf_name_appinsights will be created
  + resource "azurecaf_name" "caf_name_appinsights" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_application_insights"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.app_service.azurecaf_name.caf_name_asp will be created
  + resource "azurecaf_name" "caf_name_asp" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_app_service_plan"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.app_service.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westus2"
      + name                                  = (known after apply)
      + resource_group_name                   = (known after apply)
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.app_service.azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + app_service_environment_id   = (known after apply)
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westus2"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = (known after apply)
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = (known after apply)
      + sku_name                     = "P1v2"
      + tags                         = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "app-service"
        }
      + worker_count                 = 3
      + zone_balancing_enabled       = true
    }

  # module.bastion[0].azurecaf_name.caf_name_bastion will be created
  + resource "azurecaf_name" "caf_name_bastion" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.bastion[0].azurecaf_name.caf_name_pip will be created
  + resource "azurecaf_name" "caf_name_pip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.bastion[0].azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "westus2"
      + name                   = (known after apply)
      + resource_group_name    = (known after apply)
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "bastion"
        }
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastionHostIpConfiguration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.bastion[0].azurerm_public_ip.bastion_pip will be created
  + resource "azurerm_public_ip" "bastion_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus2"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "bastion"
        }
    }

  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[0] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = (known after apply)
      + resource_group_name = (known after apply)
      + ttl                 = 300
      + zone_name           = (known after apply)
    }

  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[1] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*.scm"
      + records             = (known after apply)
      + resource_group_name = (known after apply)
      + ttl                 = 300
      + zone_name           = (known after apply)
    }

  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[2] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = (known after apply)
      + resource_group_name = (known after apply)
      + ttl                 = 300
      + zone_name           = (known after apply)
    }

  # module.private_dns_zones_ase[0].azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = (known after apply)
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = (known after apply)
      + tags                                                  = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "private-dns-zone"
        }
    }

  # module.private_dns_zones_ase[0].azurerm_private_dns_zone_virtual_network_link.this[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = (known after apply)
      + private_dns_zone_name = (known after apply)
      + registration_enabled  = false
      + resource_group_name   = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.vnetHub.azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.vnetHub.azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.vnetHub.azurerm_subnet.this[1] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "jumpBoxSubnetName"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.vnetHub.azurerm_subnet.this[2] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "CICDAgentSubnetName"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.vnetHub.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "network"
        }
    }

  # module.vnetSpoke[0].azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lzademo"
      + passthrough   = false
      + prefixes      = [
          + "secure-baseline-2-ase",
          + "wus2",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.vnetSpoke[0].azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "hostingEnvironment"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)

      + delegation {
          + name = "Microsoft.Web/serverFarms"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Web/hostingEnvironments"
            }
        }
    }

  # module.vnetSpoke[0].azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "network"
        }
    }

  # module.vnetSpoke[0].azurerm_virtual_network_peering.target_to_this[0] will be created
  + resource "azurerm_virtual_network_peering" "target_to_this" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-spoke-lzademo"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.vnetSpoke[0].azurerm_virtual_network_peering.this_to_target[0] will be created
  + resource "azurerm_virtual_network_peering" "this_to_target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "spoke-to-hub-lzademo"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aseId     = (known after apply)
  + aseName   = (known after apply)
  + hubVNet   = {
      + id      = (known after apply)
      + name    = (known after apply)
      + subnets = {
          + AzureBastionSubnet  = {
              + address_prefixes                               = [
                  + "10.0.1.0/24",
                ]
              + delegation                                     = []
              + enforce_private_link_endpoint_network_policies = (known after apply)
              + enforce_private_link_service_network_policies  = (known after apply)
              + id                                             = (known after apply)
              + name                                           = "AzureBastionSubnet"
              + private_endpoint_network_policies_enabled      = (known after apply)
              + private_link_service_network_policies_enabled  = (known after apply)
              + resource_group_name                            = (known after apply)
              + service_endpoint_policy_ids                    = null
              + service_endpoints                              = null
              + timeouts                                       = null
              + virtual_network_name                           = (known after apply)
            }
          + CICDAgentSubnetName = {
              + address_prefixes                               = [
                  + "10.0.2.0/24",
                ]
              + delegation                                     = []
              + enforce_private_link_endpoint_network_policies = (known after apply)
              + enforce_private_link_service_network_policies  = (known after apply)
              + id                                             = (known after apply)
              + name                                           = "CICDAgentSubnetName"
              + private_endpoint_network_policies_enabled      = (known after apply)
              + private_link_service_network_policies_enabled  = (known after apply)
              + resource_group_name                            = (known after apply)
              + service_endpoint_policy_ids                    = null
              + service_endpoints                              = null
              + timeouts                                       = null
              + virtual_network_name                           = (known after apply)
            }
          + jumpBoxSubnetName   = {
              + address_prefixes                               = [
                  + "10.0.3.0/24",
                ]
              + delegation                                     = []
              + enforce_private_link_endpoint_network_policies = (known after apply)
              + enforce_private_link_service_network_policies  = (known after apply)
              + id                                             = (known after apply)
              + name                                           = "jumpBoxSubnetName"
              + private_endpoint_network_policies_enabled      = (known after apply)
              + private_link_service_network_policies_enabled  = (known after apply)
              + resource_group_name                            = (known after apply)
              + service_endpoint_policy_ids                    = null
              + service_endpoints                              = null
              + timeouts                                       = null
              + virtual_network_name                           = (known after apply)
            }
        }
    }
  + spokeVNet = {
      + id      = (known after apply)
      + name    = (known after apply)
      + subnets = {
          + hostingEnvironment = {
              + address_prefixes                               = [
                  + "10.1.1.0/24",
                ]
              + delegation                                     = [
                  + {
                      + name               = "Microsoft.Web/serverFarms"
                      + service_delegation = [
                          + {
                              + actions = [
                                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                ]
                              + name    = "Microsoft.Web/hostingEnvironments"
                            },
                        ]
                    },
                ]
              + enforce_private_link_endpoint_network_policies = (known after apply)
              + enforce_private_link_service_network_policies  = (known after apply)
              + id                                             = (known after apply)
              + name                                           = "hostingEnvironment"
              + private_endpoint_network_policies_enabled      = (known after apply)
              + private_link_service_network_policies_enabled  = (known after apply)
              + resource_group_name                            = (known after apply)
              + service_endpoint_policy_ids                    = null
              + service_endpoints                              = null
              + timeouts                                       = null
              + virtual_network_name                           = (known after apply)
            }
        }
    }
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurecaf_name.caf_name_ase_rg will be created%0A  + resource "azurecaf_name" "caf_name_ase_rg" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "ase",%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_resource_group"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.caf_name_ase_v3[0] will be created%0A  + resource "azurecaf_name" "caf_name_ase_v3" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_app_service_environment"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.caf_name_law will be created%0A  + resource "azurecaf_name" "caf_name_law" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_log_analytics_workspace"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.caf_name_network_rg will be created%0A  + resource "azurecaf_name" "caf_name_network_rg" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "network",%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_resource_group"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.caf_name_shared_rg will be created%0A  + resource "azurecaf_name" "caf_name_shared_rg" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "shared",%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_resource_group"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # azurecaf_name.law will be created%0A  + resource "azurecaf_name" "law" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + random_length = 0%0A      + resource_type = "azurerm_log_analytics_workspace"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # azurerm_app_service_environment_v3.ase[0] will be created%0A  + resource "azurerm_app_service_environment_v3" "ase" {%0A      + allow_new_private_endpoint_connections = true%0A      + dns_suffix                             = (known after apply)%0A      + external_inbound_ip_addresses          = (known after apply)%0A      + id                                     = (known after apply)%0A      + inbound_network_dependencies           = (known after apply)%0A      + internal_inbound_ip_addresses          = (known after apply)%0A      + internal_load_balancing_mode           = "Web, Publishing"%0A      + ip_ssl_address_count                   = (known after apply)%0A      + linux_outbound_ip_addresses            = (known after apply)%0A      + location                               = (known after apply)%0A      + name                                   = (known after apply)%0A      + pricing_tier                           = (known after apply)%0A      + resource_group_name                    = (known after apply)%0A      + subnet_id                              = (known after apply)%0A      + windows_outbound_ip_addresses          = (known after apply)%0A      + zone_redundant                         = true%0A    }%0A%0A  # azurerm_log_analytics_workspace.law will be created%0A  + resource "azurerm_log_analytics_workspace" "law" {%0A      + allow_resource_only_permissions    = true%0A      + daily_quota_gb                     = -1%0A      + id                                 = (known after apply)%0A      + internet_ingestion_enabled         = true%0A      + internet_query_enabled             = true%0A      + local_authentication_disabled      = false%0A      + location                           = "westus2"%0A      + name                               = (known after apply)%0A      + primary_shared_key                 = (sensitive value)%0A      + reservation_capacity_in_gb_per_day = (known after apply)%0A      + resource_group_name                = (known after apply)%0A      + retention_in_days                  = 30%0A      + secondary_shared_key               = (sensitive value)%0A      + sku                                = "PerGB2018"%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A        }%0A      + workspace_id                       = (known after apply)%0A    }%0A%0A  # azurerm_resource_group.ase will be created%0A  + resource "azurerm_resource_group" "ase" {%0A      + id       = (known after apply)%0A      + location = "westus2"%0A      + name     = (known after apply)%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A        }%0A    }%0A%0A  # azurerm_resource_group.network will be created%0A  + resource "azurerm_resource_group" "network" {%0A      + id       = (known after apply)%0A      + location = "westus2"%0A      + name     = (known after apply)%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A        }%0A    }%0A%0A  # azurerm_resource_group.shared will be created%0A  + resource "azurerm_resource_group" "shared" {%0A      + id       = (known after apply)%0A      + location = "westus2"%0A      + name     = (known after apply)%0A      + tags     = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A        }%0A    }%0A%0A  # module.app_service.azurecaf_name.caf_name_appinsights will be created%0A  + resource "azurecaf_name" "caf_name_appinsights" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_application_insights"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # module.app_service.azurecaf_name.caf_name_asp will be created%0A  + resource "azurecaf_name" "caf_name_asp" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_app_service_plan"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # module.app_service.azurerm_application_insights.this will be created%0A  + resource "azurerm_application_insights" "this" {%0A      + app_id                                = (known after apply)%0A      + application_type                      = "web"%0A      + connection_string                     = (sensitive value)%0A      + daily_data_cap_in_gb                  = (known after apply)%0A      + daily_data_cap_notifications_disabled = (known after apply)%0A      + disable_ip_masking                    = false%0A      + force_customer_storage_for_profiler   = false%0A      + id                                    = (known after apply)%0A      + instrumentation_key                   = (sensitive value)%0A      + internet_ingestion_enabled            = true%0A      + internet_query_enabled                = true%0A      + local_authentication_disabled         = false%0A      + location                              = "westus2"%0A      + name                                  = (known after apply)%0A      + resource_group_name                   = (known after apply)%0A      + retention_in_days                     = 90%0A      + sampling_percentage                   = 100%0A      + workspace_id                          = (known after apply)%0A    }%0A%0A  # module.app_service.azurerm_service_plan.this will be created%0A  + resource "azurerm_service_plan" "this" {%0A      + app_service_environment_id   = (known after apply)%0A      + id                           = (known after apply)%0A      + kind                         = (known after apply)%0A      + location                     = "westus2"%0A      + maximum_elastic_worker_count = (known after apply)%0A      + name                         = (known after apply)%0A      + os_type                      = "Windows"%0A      + per_site_scaling_enabled     = false%0A      + reserved                     = (known after apply)%0A      + resource_group_name          = (known after apply)%0A      + sku_name                     = "P1v2"%0A      + tags                         = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "app-service"%0A        }%0A      + worker_count                 = 3%0A      + zone_balancing_enabled       = true%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_bastion will be created%0A  + resource "azurecaf_name" "caf_name_bastion" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_virtual_network"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_pip will be created%0A  + resource "azurecaf_name" "caf_name_pip" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_public_ip"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + use_slug      = true%0A    }%0A%0A  # module.bastion[0].azurerm_bastion_host.bastion will be created%0A  + resource "azurerm_bastion_host" "bastion" {%0A      + copy_paste_enabled     = true%0A      + dns_name               = (known after apply)%0A      + file_copy_enabled      = false%0A      + id                     = (known after apply)%0A      + ip_connect_enabled     = false%0A      + location               = "westus2"%0A      + name                   = (known after apply)%0A      + resource_group_name    = (known after apply)%0A      + scale_units            = 2%0A      + shareable_link_enabled = false%0A      + sku                    = "Standard"%0A      + tags                   = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "bastion"%0A        }%0A      + tunneling_enabled      = true%0A%0A      + ip_configuration {%0A          + name                 = "bastionHostIpConfiguration"%0A          + public_ip_address_id = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # module.bastion[0].azurerm_public_ip.bastion_pip will be created%0A  + resource "azurerm_public_ip" "bastion_pip" {%0A      + allocation_method       = "Static"%0A      + ddos_protection_mode    = "VirtualNetworkInherited"%0A      + fqdn                    = (known after apply)%0A      + id                      = (known after apply)%0A      + idle_timeout_in_minutes = 4%0A      + ip_address              = (known after apply)%0A      + ip_version              = "IPv4"%0A      + location                = "westus2"%0A      + name                    = (known after apply)%0A      + resource_group_name     = (known after apply)%0A      + sku                     = "Standard"%0A      + sku_tier                = "Regional"%0A      + tags                    = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "bastion"%0A        }%0A    }%0A%0A  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[0] will be created%0A  + resource "azurerm_private_dns_a_record" "this" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "*"%0A      + records             = (known after apply)%0A      + resource_group_name = (known after apply)%0A      + ttl                 = 300%0A      + zone_name           = (known after apply)%0A    }%0A%0A  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[1] will be created%0A  + resource "azurerm_private_dns_a_record" "this" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "*.scm"%0A      + records             = (known after apply)%0A      + resource_group_name = (known after apply)%0A      + ttl                 = 300%0A      + zone_name           = (known after apply)%0A    }%0A%0A  # module.private_dns_zones_ase[0].azurerm_private_dns_a_record.this[2] will be created%0A  + resource "azurerm_private_dns_a_record" "this" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "@"%0A      + records             = (known after apply)%0A      + resource_group_name = (known after apply)%0A      + ttl                 = 300%0A      + zone_name           = (known after apply)%0A    }%0A%0A  # module.private_dns_zones_ase[0].azurerm_private_dns_zone.this will be created%0A  + resource "azurerm_private_dns_zone" "this" {%0A      + id                                                    = (known after apply)%0A      + max_number_of_record_sets                             = (known after apply)%0A      + max_number_of_virtual_network_links                   = (known after apply)%0A      + max_number_of_virtual_network_links_with_registration = (known after apply)%0A      + name                                                  = (known after apply)%0A      + number_of_record_sets                                 = (known after apply)%0A      + resource_group_name                                   = (known after apply)%0A      + tags                                                  = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "private-dns-zone"%0A        }%0A    }%0A%0A  # module.private_dns_zones_ase[0].azurerm_private_dns_zone_virtual_network_link.this[0] will be created%0A  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + private_dns_zone_name = (known after apply)%0A      + registration_enabled  = false%0A      + resource_group_name   = (known after apply)%0A      + virtual_network_id    = (known after apply)%0A    }%0A%0A  # module.vnetHub.azurecaf_name.caf_name_vnet will be created%0A  + resource "azurecaf_name" "caf_name_vnet" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_virtual_network"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # module.vnetHub.azurerm_subnet.this[0] will be created%0A  + resource "azurerm_subnet" "this" {%0A      + address_prefixes                               = [%0A          + "10.0.1.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "AzureBastionSubnet"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = (known after apply)%0A      + virtual_network_name                           = (known after apply)%0A    }%0A%0A  # module.vnetHub.azurerm_subnet.this[1] will be created%0A  + resource "azurerm_subnet" "this" {%0A      + address_prefixes                               = [%0A          + "10.0.3.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "jumpBoxSubnetName"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = (known after apply)%0A      + virtual_network_name                           = (known after apply)%0A    }%0A%0A  # module.vnetHub.azurerm_subnet.this[2] will be created%0A  + resource "azurerm_subnet" "this" {%0A      + address_prefixes                               = [%0A          + "10.0.2.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "CICDAgentSubnetName"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = (known after apply)%0A      + virtual_network_name                           = (known after apply)%0A    }%0A%0A  # module.vnetHub.azurerm_virtual_network.this will be created%0A  + resource "azurerm_virtual_network" "this" {%0A      + address_space       = [%0A          + "10.0.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "westus2"%0A      + name                = (known after apply)%0A      + resource_group_name = (known after apply)%0A      + subnet              = (known after apply)%0A      + tags                = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "network"%0A        }%0A    }%0A%0A  # module.vnetSpoke[0].azurecaf_name.caf_name_vnet will be created%0A  + resource "azurecaf_name" "caf_name_vnet" {%0A      + clean_input   = true%0A      + id            = (known after apply)%0A      + name          = "lzademo"%0A      + passthrough   = false%0A      + prefixes      = [%0A          + "secure-baseline-2-ase",%0A          + "wus2",%0A        ]%0A      + random_length = 0%0A      + resource_type = "azurerm_virtual_network"%0A      + result        = (known after apply)%0A      + results       = (known after apply)%0A      + separator     = "-"%0A      + suffixes      = [%0A          + "dev",%0A        ]%0A      + use_slug      = true%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_subnet.this[0] will be created%0A  + resource "azurerm_subnet" "this" {%0A      + address_prefixes                               = [%0A          + "10.1.1.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "hostingEnvironment"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = (known after apply)%0A      + virtual_network_name                           = (known after apply)%0A%0A      + delegation {%0A          + name = "Microsoft.Web/serverFarms"%0A%0A          + service_delegation {%0A              + actions = [%0A                  + "Microsoft.Network/virtualNetworks/subnets/join/action",%0A                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",%0A                ]%0A              + name    = "Microsoft.Web/hostingEnvironments"%0A            }%0A        }%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_virtual_network.this will be created%0A  + resource "azurerm_virtual_network" "this" {%0A      + address_space       = [%0A          + "10.1.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "westus2"%0A      + name                = (known after apply)%0A      + resource_group_name = (known after apply)%0A      + subnet              = (known after apply)%0A      + tags                = {%0A          + "Environment" = "dev"%0A          + "Owner"       = "cloudops@contoso.com"%0A          + "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A          + "Terraform"   = "true"%0A          + "module"      = "network"%0A        }%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_virtual_network_peering.target_to_this[0] will be created%0A  + resource "azurerm_virtual_network_peering" "target_to_this" {%0A      + allow_forwarded_traffic      = false%0A      + allow_gateway_transit        = false%0A      + allow_virtual_network_access = true%0A      + id                           = (known after apply)%0A      + name                         = "hub-to-spoke-lzademo"%0A      + remote_virtual_network_id    = (known after apply)%0A      + resource_group_name          = (known after apply)%0A      + use_remote_gateways          = false%0A      + virtual_network_name         = (known after apply)%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_virtual_network_peering.this_to_target[0] will be created%0A  + resource "azurerm_virtual_network_peering" "this_to_target" {%0A      + allow_forwarded_traffic      = false%0A      + allow_gateway_transit        = false%0A      + allow_virtual_network_access = true%0A      + id                           = (known after apply)%0A      + name                         = "spoke-to-hub-lzademo"%0A      + remote_virtual_network_id    = (known after apply)%0A      + resource_group_name          = (known after apply)%0A      + use_remote_gateways          = false%0A      + virtual_network_name         = (known after apply)%0A    }%0A%0APlan: 34 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + aseId     = (known after apply)%0A  + aseName   = (known after apply)%0A  + hubVNet   = {%0A      + id      = (known after apply)%0A      + name    = (known after apply)%0A      + subnets = {%0A          + AzureBastionSubnet  = {%0A              + address_prefixes                               = [%0A                  + "10.0.1.0/24",%0A                ]%0A              + delegation                                     = []%0A              + enforce_private_link_endpoint_network_policies = (known after apply)%0A              + enforce_private_link_service_network_policies  = (known after apply)%0A              + id                                             = (known after apply)%0A              + name                                           = "AzureBastionSubnet"%0A              + private_endpoint_network_policies_enabled      = (known after apply)%0A              + private_link_service_network_policies_enabled  = (known after apply)%0A              + resource_group_name                            = (known after apply)%0A              + service_endpoint_policy_ids                    = null%0A              + service_endpoints                              = null%0A              + timeouts                                       = null%0A              + virtual_network_name                           = (known after apply)%0A            }%0A          + CICDAgentSubnetName = {%0A              + address_prefixes                               = [%0A                  + "10.0.2.0/24",%0A                ]%0A              + delegation                                     = []%0A              + enforce_private_link_endpoint_network_policies = (known after apply)%0A              + enforce_private_link_service_network_policies  = (known after apply)%0A              + id                                             = (known after apply)%0A              + name                                           = "CICDAgentSubnetName"%0A              + private_endpoint_network_policies_enabled      = (known after apply)%0A              + private_link_service_network_policies_enabled  = (known after apply)%0A              + resource_group_name                            = (known after apply)%0A              + service_endpoint_policy_ids                    = null%0A              + service_endpoints                              = null%0A              + timeouts                                       = null%0A              + virtual_network_name                           = (known after apply)%0A            }%0A          + jumpBoxSubnetName   = {%0A              + address_prefixes                               = [%0A                  + "10.0.3.0/24",%0A                ]%0A              + delegation                                     = []%0A              + enforce_private_link_endpoint_network_policies = (known after apply)%0A              + enforce_private_link_service_network_policies  = (known after apply)%0A              + id                                             = (known after apply)%0A              + name                                           = "jumpBoxSubnetName"%0A              + private_endpoint_network_policies_enabled      = (known after apply)%0A              + private_link_service_network_policies_enabled  = (known after apply)%0A              + resource_group_name                            = (known after apply)%0A              + service_endpoint_policy_ids                    = null%0A              + service_endpoints                              = null%0A              + timeouts                                       = null%0A              + virtual_network_name                           = (known after apply)%0A            }%0A        }%0A    }%0A  + spokeVNet = {%0A      + id      = (known after apply)%0A      + name    = (known after apply)%0A      + subnets = {%0A          + hostingEnvironment = {%0A              + address_prefixes                               = [%0A                  + "10.1.1.0/24",%0A                ]%0A              + delegation                                     = [%0A                  + {%0A                      + name               = "Microsoft.Web/serverFarms"%0A                      + service_delegation = [%0A                          + {%0A                              + actions = [%0A                                  + "Microsoft.Network/virtualNetworks/subnets/join/action",%0A                                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",%0A                                ]%0A                              + name    = "Microsoft.Web/hostingEnvironments"%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + enforce_private_link_endpoint_network_policies = (known after apply)%0A              + enforce_private_link_service_network_policies  = (known after apply)%0A              + id                                             = (known after apply)%0A              + name                                           = "hostingEnvironment"%0A              + private_endpoint_network_policies_enabled      = (known after apply)%0A              + private_link_service_network_policies_enabled  = (known after apply)%0A              + resource_group_name                            = (known after apply)%0A              + service_endpoint_policy_ids                    = null%0A              + service_endpoints                              = null%0A              + timeouts                                       = null%0A              + virtual_network_name                           = (known after apply)%0A            }%0A        }%0A    }%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-ase/terraform`, Workflow: `Scenario 2: Terraform Single-tenant ASEv3 Secure Baseline`*